// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "尊敬的老邹邹",  // 同上...
        "今天是我们认识的",
        "第352天",
        "也是你的生日（又老一岁【手动狗头】）",
        "新的一岁，",
        "愿你贪吃不胖，",
        "愿你懒惰不丑，",
        "愿你永远健康美好依旧，",
        "愿你从旧衣服摸到零钱，",
        "愿你做过的美梦全都实现",
        "愿你永远都有好运气，",
        "愿这岁月悠长，",
        "我们即使不见亦能不能散。",
        "若这一切太难，",
        "我只愿你一生简单，",
        "一生平安！",
        "吆西！",
        "ps",
        "“网络一线牵，相逢即是缘”",
        "这次我真的生气了，",
        "但我也反思了自己。",
        "认识你的这一年真的多了很多快乐，",
        "之前的我不太会主动跟身边的朋友分享自己的日常和爱好，",
        "是你的出现打开了我的内心，改变了那个内向寡言的我",
        "我真的把你当作了我们第一次认识时说的“知己”",
        "所以每次跟你聊天我都很开心，",
        "很在意你跟我说的每一句话，",
        "很在意你为什么还没有回我消息",
        "很在意你为什么没有找我聊天······",
        "我喜欢跟你闹着玩，",
        "让你哄我（我可从来没有跟其他人这样过，可能真的是你改变了我）。",
        "但是你这次竟然真的就不理我了，",
        "所以我真的生气了。",
        "这两天我也确实反思了自己，",
        "可能确实是我有点“无理取闹”了吧",
        "骚凹瑞~~",
        "我真的不舍得就这样让我们的友谊走到尽头，",
        "但我尊重你的选择：",
        "如果你选择就此忘了我，",
        "那今天开始就不要再发“早哇”“晚鹌鹑蛋”了，",
        "我会自动消失，但也会永远记得这一年的快乐时光。",
        "如果你选择继续拥有我，",
        "那就立马给自己洗脑（我+1），",
        "忘记从那天晚上开始的不愉快记忆，",
        "从“早哇”开始我们新的平凡的一天。",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
